export const description = [
    {
      id: 1,
      text: "В данном проекте использовано: Хуки: UseState, useRef, useMemo, useHistory, useParams.",
    },
    {
      id: 2,
      text: "Мемоизация. Кеширование Декомпозиция. Кастомные хуки Управляемые и неуправляемые компоненты.",
    },
    {
      id: 3,
      text: "Props: аргументы компонента, props-children",
    },
    {
      id: 4,
      text: "Работы со списками: реобразование массива объектов в массив React элементов",
    },
    {
      id: 5,
      text: "Форма создания поста. Отрисовка по условию",
    },
    {
      id: 6,
      text: "Сортировка в выпадающем списоке. Поиск. Фильтрация. Модальное окно. Переиспользуемый UI компоненты Анимации.",
    },
    {
      id: 7,
      text: "Работа с сервером. Axios Жизненный цикл компонента.",
    },
    {
      id: 8,
      text: "React router. Постраничная навигация. Динамическая навигация.",
    },
    {
      id: 9,
      text: "Стилизация: CSS-Module.",
    },
  ];